企業連携まとめ

１．何をするか
Ⅰ・HTML5とjavascriptでweb上で動くゲームを作る
  →javascrptはゲーム制作以外の場面でも使うので、システム系へ就職するならやっておいて損はない
　→ただしHTML5は文系でも出来る人は出来る
　 →→HTML5でここまで作れるのか！と思うくらいの作品を作ってほしい
　  →→→いいものが作れたら買い取ります！
　  
Ⅱ・プランニング、開発、試験のスケジュールを出そう

Ⅲ・どんなゲームを作りたいか、自分のベストゲーム100を作って考えてみよう

Ⅳ・HTML5でどこまで作れるか想像してみよう

Ⅴ・ファミコン・スーパーファミコンの使用ビット数と、次世代ハード機の使用ビット数を比べてみよう

２．期間
Ⅰ・8/26に二見さんに企画を投げる（パワポ、エクセル）
  →５分ぴったりでプレゼンをする

Ⅱ・9/2に更に煮込んで再提出、OKならコーディングを開始する
  →ここで通らない場合9/30に再提出
  
Ⅲ・制作目標期間は１人月で数える
  →１人月＝２０人日（１日８時間）＝１６０時間

３．アドバイス
Ⅰ・テストをするのは非常に大事
  →お客さん皆が最新の端末を持っているわけではないので、色々な端末でのテストをしよう
  →スマホ、PCどちらでも動くように開発をしよう
    →→スマホのテストブラウザは、iphoneはサファリ、androidはクロームを使う
  →地下鉄など、特殊な環境でのテストも重要

Ⅲ・ドキュメントを書く癖をつけよう

Ⅳ・Unityが出来るではなく、C#が出来るようになろう

Ⅴ・お客さんに自分のゲームで何をしてほしいか考える

Ⅵ・ネットに書き方が載っていたりするので、どうしてもできないという人はコピーで逃げてもいい ただし初めから逃げない

Ⅶ・「こういう仕様にしました」の理由を言えるようになろう
